Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tim1.h
/*
; stm32V873_tim1.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_tim1 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// TIM1 address definitions
// ------------------------

typedef struct {
    volatile    uint16_t    CR1;
    volatile    uint16_t    RESERVED0;
    volatile    uint32_t    CR2;
    volatile    uint32_t    SMCR;
    volatile    uint32_t    DIER;
    volatile    uint32_t    SR;
    volatile    uint16_t    EGR;
    volatile    uint16_t    RESERVED1;
    volatile    uint32_t    CCMR1;
    volatile    uint32_t    CCMR2;
    volatile    uint32_t    CCER;
    volatile    uint32_t    CNT;
    volatile    uint16_t    PSC;
    volatile    uint16_t    RESERVED2;
    volatile    uint32_t    ARR;
    volatile    uint16_t    RCR;
    volatile    uint16_t    RESERVED3;
    volatile    uint32_t    CCR1;
    volatile    uint32_t    CCR2;
    volatile    uint32_t    CCR3;
    volatile    uint32_t    CCR4;
    volatile    uint32_t    BDTR;
    volatile    uint32_t    CCR5;
    volatile    uint32_t    CCR6;
    volatile    uint32_t    CCMR3;
    volatile    uint32_t    DTR2;
    volatile    uint32_t    ECR;
    volatile    uint32_t    TISEL;
    volatile    uint32_t    AF1;
    volatile    uint32_t    AF2;
    volatile    uint32_t    RESERVED4[221];
    volatile    uint32_t    DCR;
    volatile    uint32_t    DMAR;
} TIM1_TypeDef;

#if (defined(__cplusplus))
#define TIM1_S  reinterpret_cast<TIM1_TypeDef *>(0x52000000u)

#else
#define TIM1_S  ((TIM1_TypeDef *)0x52000000u)
#endif

// CR1 Configuration

#define TIM1_CR1_DITHEN             (0x1u<<12)
#define TIM1_CR1_UIFREMAP           (0x1u<<11)
#define TIM1_CR1_CKD                (0x3u<<8)
#define TIM1_CR1_CKD_0              (0x1u<<8)
#define TIM1_CR1_ARPE               (0x1u<<7)
#define TIM1_CR1_CMS                (0x3u<<5)
#define TIM1_CR1_CMS_0              (0x1u<<5)
#define TIM1_CR1_DIR                (0x1u<<4)
#define TIM1_CR1_OPM                (0x1u<<3)
#define TIM1_CR1_URS                (0x1u<<2)
#define TIM1_CR1_UDIS               (0x1u<<1)
#define TIM1_CR1_CEN                (0x1u<<0)

#define TIM1_CR1_DITHEN_B_0X0       (0x0u<<12)
#define TIM1_CR1_DITHEN_B_0X1       (0x1u<<12)
#define TIM1_CR1_UIFREMAP_B_0X0     (0x0u<<11)
#define TIM1_CR1_UIFREMAP_B_0X1     (0x1u<<11)
#define TIM1_CR1_CKD_B_0X0          (0x0u<<8)
#define TIM1_CR1_CKD_B_0X1          (0x1u<<8)
#define TIM1_CR1_CKD_B_0X2          (0x2u<<8)
#define TIM1_CR1_CKD_B_0X3          (0x3u<<8)
#define TIM1_CR1_ARPE_B_0X0         (0x0u<<7)
#define TIM1_CR1_ARPE_B_0X1         (0x1u<<7)
#define TIM1_CR1_CMS_B_0X0          (0x0u<<5)
#define TIM1_CR1_CMS_B_0X1          (0x1u<<5)
#define TIM1_CR1_CMS_B_0X2          (0x2u<<5)
#define TIM1_CR1_CMS_B_0X3          (0x3u<<5)
#define TIM1_CR1_DIR_B_0X0          (0x0u<<4)
#define TIM1_CR1_DIR_B_0X1          (0x1u<<4)
#define TIM1_CR1_OPM_B_0X0          (0x0u<<3)
#define TIM1_CR1_OPM_B_0X1          (0x1u<<3)
#define TIM1_CR1_URS_B_0X0          (0x0u<<2)
#define TIM1_CR1_URS_B_0X1          (0x1u<<2)
#define TIM1_CR1_UDIS_B_0X0         (0x0u<<1)
#define TIM1_CR1_UDIS_B_0X1         (0x1u<<1)
#define TIM1_CR1_CEN_B_0X0          (0x0u<<0)
#define TIM1_CR1_CEN_B_0X1          (0x1u<<0)

// CR2 Configuration

#define TIM1_CR2_ADSYNC             (0x1u<<28)
#define TIM1_CR2_MMS_1              (0x1u<<25)
#define TIM1_CR2_MMS2               (0xFu<<20)
#define TIM1_CR2_MMS2_0             (0x1u<<20)
#define TIM1_CR2_OIS6               (0x1u<<18)
#define TIM1_CR2_OIS5               (0x1u<<16)
#define TIM1_CR2_OIS4N              (0x1u<<15)
#define TIM1_CR2_OIS4               (0x1u<<14)
#define TIM1_CR2_OIS3N              (0x1u<<13)
#define TIM1_CR2_OIS3               (0x1u<<12)
#define TIM1_CR2_OIS2N              (0x1u<<11)
#define TIM1_CR2_OIS2               (0x1u<<10)
#define TIM1_CR2_OIS1N              (0x1u<<9)
#define TIM1_CR2_OIS1               (0x1u<<8)
#define TIM1_CR2_TI1S               (0x1u<<7)
#define TIM1_CR2_MMS                (0x7u<<4)
#define TIM1_CR2_MMS_0              (0x1u<<4)
#define TIM1_CR2_CCDS               (0x1u<<3)
#define TIM1_CR2_CCUS               (0x1u<<2)
#define TIM1_CR2_CCPC               (0x1u<<0)

#define TIM1_CR2_ADSYNC_B_0X0       (0x0u<<28)
#define TIM1_CR2_ADSYNC_B_0X1       (0x1u<<28)
#define TIM1_CR2_MMS2_B_0X0         (0x0u<<20)
#define TIM1_CR2_MMS2_B_0X1         (0x1u<<20)
#define TIM1_CR2_MMS2_B_0X2         (0x2u<<20)
#define TIM1_CR2_MMS2_B_0X3         (0x3u<<20)
#define TIM1_CR2_MMS2_B_0X4         (0x4u<<20)
#define TIM1_CR2_MMS2_B_0X5         (0x5u<<20)
#define TIM1_CR2_MMS2_B_0X6         (0x6u<<20)
#define TIM1_CR2_MMS2_B_0X7         (0x7u<<20)
#define TIM1_CR2_MMS2_B_0X8         (0x8u<<20)
#define TIM1_CR2_MMS2_B_0X9         (0x9u<<20)
#define TIM1_CR2_MMS2_B_0XA         (0xAu<<20)
#define TIM1_CR2_MMS2_B_0XB         (0xBu<<20)
#define TIM1_CR2_MMS2_B_0XC         (0xCu<<20)
#define TIM1_CR2_MMS2_B_0XD         (0xDu<<20)
#define TIM1_CR2_MMS2_B_0XE         (0xEu<<20)
#define TIM1_CR2_MMS2_B_0XF         (0xFu<<20)
#define TIM1_CR2_OIS1N_B_0X0        (0x0u<<9)
#define TIM1_CR2_OIS1N_B_0X1        (0x1u<<9)
#define TIM1_CR2_OIS1_B_0X0         (0x0u<<8)
#define TIM1_CR2_OIS1_B_0X1         (0x1u<<8)
#define TIM1_CR2_TI1S_B_0X0         (0x0u<<7)
#define TIM1_CR2_TI1S_B_0X1         (0x1u<<7)
#define TIM1_CR2_MMS_B_0X0          (0x0u<<4)
#define TIM1_CR2_MMS_B_0X1          (0x1u<<4)
#define TIM1_CR2_MMS_B_0X2          (0x2u<<4)
#define TIM1_CR2_MMS_B_0X3          (0x3u<<4)
#define TIM1_CR2_MMS_B_0X4          (0x4u<<4)
#define TIM1_CR2_MMS_B_0X5          (0x5u<<4)
#define TIM1_CR2_MMS_B_0X6          (0x6u<<4)
#define TIM1_CR2_MMS_B_0X7          (0x7u<<4)
#define TIM1_CR2_CCDS_B_0X0         (0x0u<<3)
#define TIM1_CR2_CCDS_B_0X1         (0x1u<<3)
#define TIM1_CR2_CCUS_B_0X0         (0x0u<<2)
#define TIM1_CR2_CCUS_B_0X1         (0x1u<<2)
#define TIM1_CR2_CCPC_B_0X0         (0x0u<<0)
#define TIM1_CR2_CCPC_B_0X1         (0x1u<<0)

